k6_test/result.txt
execution: local
        script: sign_up_and_delete_user.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ user creation status is 201
     ✓ user deletion status is 200

     checks.........................: 100.00% ✓ 7116      ✗ 0   
     data_received..................: 2.5 MB  10 kB/s
     data_sent......................: 1.3 MB  5.6 kB/s
     http_req_blocked...............: avg=802.81µs min=137µs med=532.5µs max=13.79ms  p(90)=1.93ms  p(95)=2.26ms  
     http_req_connecting............: avg=740.19µs min=125µs med=489.5µs max=11.84ms  p(90)=1.79ms  p(95)=2.08ms  
     http_req_duration..............: avg=10.42ms  min=864µs med=6.6ms   max=104.76ms p(90)=23.93ms p(95)=32.13ms 
       { expected_response:true }...: avg=10.42ms  min=864µs med=6.6ms   max=104.76ms p(90)=23.93ms p(95)=32.13ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 7116
     http_req_receiving.............: avg=136.38µs min=13µs  med=46µs    max=5.36ms   p(90)=309µs   p(95)=529.49µs
     http_req_sending...............: avg=42.27µs  min=4µs   med=23µs    max=1.36ms   p(90)=97µs    p(95)=124.24µs
     http_req_tls_handshaking.......: avg=0s       min=0s    med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=10.24ms  min=842µs med=6.41ms  max=104.68ms p(90)=23.74ms p(95)=31.95ms 
     http_reqs......................: 7116    29.633845/s
     iteration_duration.............: avg=1.02s    min=1s    med=1.01s   max=1.11s    p(90)=1.04s   p(95)=1.05s   
     iterations.....................: 3558    14.816923/s
     vus............................: 1       min=1       max=20
     vus_max........................: 20      min=20      max=20


running (4m00.1s), 00/20 VUs, 3558 complete and 0 interrupted iterations


execution: local
        script: get_user_info.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ status is 200
     ✓ response time is < 500ms

     checks.........................: 100.00% ✓ 7210      ✗ 0   
     data_received..................: 1.5 MB  6.1 kB/s
     data_sent......................: 454 kB  1.9 kB/s
     http_req_blocked...............: avg=1.72ms  min=184µs med=1.91ms max=17.72ms p(90)=2.47ms  p(95)=2.68ms  
     http_req_connecting............: avg=1.6ms   min=158µs med=1.78ms max=12.92ms p(90)=2.32ms  p(95)=2.52ms  
     http_req_duration..............: avg=6.62ms  min=586µs med=6.41ms max=38.12ms p(90)=10.45ms p(95)=11.73ms 
       { expected_response:true }...: avg=6.62ms  min=586µs med=6.41ms max=38.12ms p(90)=10.45ms p(95)=11.73ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 3605
     http_req_receiving.............: avg=357.1µs min=17µs  med=137µs  max=9.16ms  p(90)=1ms     p(95)=1.47ms  
     http_req_sending...............: avg=80.91µs min=8µs   med=65µs   max=15.38ms p(90)=114µs   p(95)=146.79µs
     http_req_tls_handshaking.......: avg=0s      min=0s    med=0s     max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=6.18ms  min=558µs med=5.92ms max=37.89ms p(90)=9.98ms  p(95)=11.21ms 
     http_reqs......................: 3605    15.004755/s
     iteration_duration.............: avg=1s      min=1s    med=1s     max=1.04s   p(90)=1.01s   p(95)=1.01s   
     iterations.....................: 3605    15.004755/s
     vus............................: 1       min=1       max=20
     vus_max........................: 20      min=20      max=20


running (4m00.3s), 00/20 VUs, 3605 complete and 0 interrupted iterations


execution: local
        script: create_menu_item.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ item creation status is 201

     checks.........................: 100.00% ✓ 3606      ✗ 0   
     data_received..................: 1.6 MB  6.7 kB/s
     data_sent......................: 970 kB  4.0 kB/s
     http_req_blocked...............: avg=1.01ms   min=157µs  med=943µs    max=6.29ms  p(90)=1.71ms  p(95)=1.84ms  
     http_req_connecting............: avg=926.53µs min=140µs  med=865.49µs max=6.14ms  p(90)=1.57ms  p(95)=1.69ms  
     http_req_duration..............: avg=7.34ms   min=1.14ms med=6.58ms   max=71.14ms p(90)=12.5ms  p(95)=15.62ms 
       { expected_response:true }...: avg=7.34ms   min=1.14ms med=6.58ms   max=71.14ms p(90)=12.5ms  p(95)=15.62ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 3606
     http_req_receiving.............: avg=94.92µs  min=17µs   med=57µs     max=2.45ms  p(90)=157µs   p(95)=276.49µs
     http_req_sending...............: avg=62.75µs  min=9µs    med=48µs     max=4.09ms  p(90)=109.5µs p(95)=132µs   
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=7.19ms   min=1.11ms med=6.41ms   max=71.01ms p(90)=12.33ms p(95)=15.47ms 
     http_reqs......................: 3606    15.013595/s
     iteration_duration.............: avg=1s       min=1s     med=1s       max=1.07s   p(90)=1.01s   p(95)=1.01s   
     iterations.....................: 3606    15.013595/s
     vus............................: 1       min=1       max=20
     vus_max........................: 20      min=20      max=20


running (4m00.2s), 00/20 VUs, 3606 complete and 0 interrupted iterations


execution: local
        script: get_menu_item.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ status is 200
     ✗ response time is < 500ms
      ↳  56% — ✓ 707 / ✗ 553

     checks.........................: 78.05% ✓ 1967     ✗ 553 
     data_received..................: 1.4 GB 6.0 MB/s
     data_sent......................: 163 kB 677 B/s
     http_req_blocked...............: avg=891.42µs min=252µs   med=791µs    max=8.16ms  p(90)=1.08ms p(95)=1.42ms
     http_req_connecting............: avg=845.17µs min=226µs   med=752µs    max=7.54ms  p(90)=1.03ms p(95)=1.35ms
     http_req_duration..............: avg=1.89s    min=52.65ms med=101.24ms max=5.97s   p(90)=4.74s  p(95)=5.05s 
       { expected_response:true }...: avg=1.89s    min=52.65ms med=101.24ms max=5.97s   p(90)=4.74s  p(95)=5.05s 
     http_req_failed................: 0.00%  ✓ 0        ✗ 1260
     http_req_receiving.............: avg=1.08ms   min=662µs   med=962µs    max=13.01ms p(90)=1.46ms p(95)=1.62ms
     http_req_sending...............: avg=26.62µs  min=11µs    med=21µs     max=360µs   p(90)=35µs   p(95)=52µs  
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s     p(95)=0s    
     http_req_waiting...............: avg=1.89s    min=51.92ms med=100.28ms max=5.97s   p(90)=4.74s  p(95)=5.05s 
     http_reqs......................: 1260   5.248719/s
     iteration_duration.............: avg=2.9s     min=1.05s   med=1.1s     max=6.98s   p(90)=5.74s  p(95)=6.05s 
     iterations.....................: 1260   5.248719/s
     vus............................: 1      min=1      max=20
     vus_max........................: 20     min=20     max=20


running (4m00.1s), 00/20 VUs, 1260 complete and 0 interrupted iterations

execution: local
        script: create_order.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ order creation status is 201

     checks.........................: 100.00% ✓ 3584      ✗ 0   
     data_received..................: 4.6 MB  19 kB/s
     data_sent......................: 910 kB  3.8 kB/s
     http_req_blocked...............: avg=1.25ms   min=187µs  med=1.15ms  max=19ms    p(90)=2.1ms   p(95)=2.23ms  
     http_req_connecting............: avg=1.15ms   min=169µs  med=1.06ms  max=15.96ms p(90)=1.95ms  p(95)=2.06ms  
     http_req_duration..............: avg=13.4ms   min=2.22ms med=11.93ms max=79.63ms p(90)=22.95ms p(95)=28.98ms 
       { expected_response:true }...: avg=13.4ms   min=2.22ms med=11.93ms max=79.63ms p(90)=22.95ms p(95)=28.98ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 3584
     http_req_receiving.............: avg=150.97µs min=17µs   med=78µs    max=4.76ms  p(90)=314.7µs p(95)=476.84µs
     http_req_sending...............: avg=75.66µs  min=9µs    med=60µs    max=8.56ms  p(90)=124µs   p(95)=150µs   
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s      max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=13.17ms  min=2.18ms med=11.65ms max=79.51ms p(90)=22.55ms p(95)=28.45ms 
     http_reqs......................: 3584    14.902651/s
     iteration_duration.............: avg=1.01s    min=1s     med=1.01s   max=1.08s   p(90)=1.02s   p(95)=1.03s   
     iterations.....................: 3584    14.902651/s
     vus............................: 1       min=1       max=20
     vus_max........................: 20      min=20      max=20


running (4m00.5s), 00/20 VUs, 3584 complete and 0 interrupted iterations